Tekla.Structures.Drawing.SpaceElement
The SpaceElement class defines a space between the desired elements.

Tekla.Structures.Drawing.SpaceElement.Clone
Clones the object.
Returns: A copy of the object.

Tekla.Structures.Drawing.SpaceElement.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if both objects are space elements.

Tekla.Structures.Drawing.SpaceElement.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.